cruddemowithjoins/app/views/employeefilters/index.html.erb

SELECT [countries].* FROM [countries]
---
            <td><%= employee.email %></td>
            <td><%= employee.country.name %></td>