cruddemowithjoins/app/controllers/bulkupdates_controller.rb

SELECT [departments].* FROM [departments]
SELECT [employees].* FROM [employees]
---
  def index
    @employees = Employee.includes(:department)