cruddemowithjoins/app/views/employees/edit.html.erb

SELECT [departments].* FROM [departments]
---
      <div class="col-sm-10">
        <%= f.select :department_id, options_from_collection_for_select(select_department, 'id', 'name', f.object.department_id), { include_blank: "Select Department"}, class: 'form-control', autofocus: true %>

SELECT [countries].* FROM [countries]
---
      <div class="col-sm-10">
        <%= f.select :country_id, options_from_collection_for_select(select_country, 'id', 'name', f.object.country_id), { include_blank: 'Select Country' }, class: 'form-control', autofocus: true %>